harry123180/ArduinoCore-stm32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/


menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method
menu.memory_layout=Memory Layout

################################################################################
WIO_LITE_AI.name=Wio Lite AI

WIO_LITE_AI.build.core=arduino
WIO_LITE_AI.build.board=WIO_LITE_AI
WIO_LITE_AI.build.extra_flags=-DWIO_LITE_AI {build.external_memory} -D{build.product_line} {build.enable_usb} {build.xSerial} {build.xSerial} {build.usb_manufacturer}  {build.usb_product}

WIO_LITE_AI.build.mcu=cortex-m7
WIO_LITE_AI.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
WIO_LITE_AI.build.board=WIO_LITE_AI
WIO_LITE_AI.build.series=STM32H7xx
WIO_LITE_AI.build.product_line=STM32H725xx
WIO_LITE_AI.build.variant=WIO_LITE_AI
WIO_LITE_AI.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
WIO_LITE_AI.build.pid=0x2886
WIO_LITE_AI.build.vid=0x8050
WIO_LITE_AI.build.usb_manufacturer='-DUSB_MANUFACTURER_STRING="Seeed Stduio"'
WIO_LITE_AI..build.usb_product='-DUSB_PRODUCT_STRING="WIO-LITE-AI"'

WIO_LITE_AI.menu.memory_layout.EFIR=External Flash Internal SRAM
WIO_LITE_AI.menu.memory_layout.EFIR.build.ldscript=ldscript_efir.ld
WIO_LITE_AI.menu.memory_layout.EFIR.upload.maximum_size=16777216
WIO_LITE_AI.menu.memory_layout.EFIR.upload.maximum_data_size=6291456
WIO_LITE_AI.menu.memory_layout.EFIR.build.external_memory=-DEXTERNAL_MEMORY=1
WIO_LITE_AI.menu.memory_layout.EFER=External Flash External PSRAM
WIO_LITE_AI.menu.memory_layout.EFER.build.ldscript=ldscript_efer.ld
WIO_LITE_AI.menu.memory_layout.EFER.upload.maximum_size=16777216
WIO_LITE_AI.menu.memory_layout.EFER.upload.maximum_data_size=6291456
WIO_LITE_AI.menu.memory_layout.EFER.build.external_memory=-DEXTERNAL_MEMORY=1
WIO_LITE_AI.menu.memory_layout.IFIR=Internal Flash Internal SRAM
WIO_LITE_AI.menu.memory_layout.IFIR.build.ldscript=ldscript_ifir.ld
WIO_LITE_AI.menu.memory_layout.IFIR.upload.maximum_size=524288
WIO_LITE_AI.menu.memory_layout.IFIR.upload.maximum_data_size=327680
WIO_LITE_AI.menu.memory_layout.IFIR.build.external_memory=-DEXTERNAL_MEMORY=0

WIO_LITE_AI.menu.usb.none=None
WIO_LITE_AI.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
WIO_LITE_AI.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
WIO_LITE_AI.menu.usb.CDC=CDC (no generic 'Serial')
WIO_LITE_AI.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
WIO_LITE_AI.menu.usb.HID=HID (keyboard and mouse)
WIO_LITE_AI.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
WIO_LITE_AI.menu.xusb.HSFS=High Speed in Full Speed mode
WIO_LITE_AI.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

WIO_LITE_AI.menu.upload_method.swdMethod=jlink
WIO_LITE_AI.menu.upload_method.swdMethod.upload.protocol=0
WIO_LITE_AI.menu.upload_method.swdMethod.upload.options=-g
WIO_LITE_AI.menu.upload_method.swdMethod.upload.tool=jlink

WIO_LITE_AI.menu.upload_method.uf2Method=UF2
WIO_LITE_AI.menu.upload_method.uf2Method.upload.protocol=0
WIO_LITE_AI.menu.upload_method.uf2Method.upload.options=-g
WIO_LITE_AI.menu.upload_method.uf2Method.upload.tool=uf2

